[
  {
    "title": "Social Media Application",
    "description": "Full Stack Social Media web app developed using MERN",
    "video": "https://www.youtube.com/embed/swAQcUAL7jk?si=G0lrY5hXDlUP5KDC",
    "image": "",
    "image2": "",
    "image3": "",
    "technologies": ["AWS", "Mongodb", "React", "Express", "Node", "Git"],
    "body": "Created as my 6th-semester final project using the MERN stack and AWS S3 for cloud-based image and video storage. As the team lead, I oversaw backend development, API integration with the frontend, and managed AWS S3 integration. The application is fully deployable and accessible online.",
    "github": "https://github.com/muhammadawa242/SWC_semester_project",
    "deployed": "",
    "bgcolor": "var(--hl-color)",
    "id": "1"
  },
  {
    "title": "3D Crafting Game",
    "description": "3D Crafting game in python's Panda3D game engine",
    "video": "https://www.youtube.com/embed/L68m5XXR2-s?si=AzGHaq9YDALUU40-",
    "image": "",
    "image2": "",
    "image3": "",
    "technologies": ["Panda3D Game engine", "Physics", "Git"],
    "body": "I developed a 3D crafting game for my final project for CS50P course using the Panda3D engine. Key features include FPS camera movement, WASD controls, and an item crafting system. The game supports item joining, manual adjustments, and inventory management. It uses a modular, object-oriented design with bullet physics for movement and collision detection. The project includes a basic game design document and asset management. Future plans involve improving rotation functionality, saving crafted models, and refining collision handling.",
    "github": "https://github.com/muhammadawa242/cs50p_3d_game",
    "deployed": "",
    "bgcolor": "var(--hl2-color)",
    "id": "2"
  },
  {
    "title": "Library Management System",
    "description": "Library Management System developed in Java",
    "video": "https://www.youtube.com/embed/j8p56VwMa5E?si=5wl-yIhOkAEtL4Bf",
    "image": "../images/lms.png",
    "image2": "",
    "image3": "",
    "body": "I developed this management system as my final semester project during my freshman year. It aimed to streamline library operations, offering features for book categorization, user management, and transaction tracking. The system was built using Java, featuring a desktop-based interface with graphical user interface (GUI) elements.",
    "technologies": ["Java", "Desktop", "GUI"],
    "github": "https://github.com/muhammadawa242/Library_Management_System",
    "deployed": "",
    "bgcolor": "var(--hl2-color)",
    "id": "3"
  },
  {
    "title": "Space Invaders Game",
    "description": "2D Desktop game",
    "video": "https://www.youtube.com/embed/z_ngTQi2ttw?si=4Gd_8rNswJpjXeyf",
    "image": "../images/peaky_invaders.png",
    "image2": "",
    "image3": "",
    "technologies": ["Python", "Pygame", "Game Development"],
    "body": "This game serves as the culmination of my work in the CS50X course, developed using Python's Pygame library. It involved designing and coding a 2D space invaders game, integrating graphics, sound, and user interaction. The project showcased my proficiency in Python programming and game development.",
    "github": "https://github.com/muhammadawa242/CS50_Game_project",
    "deployed": "https://mawaiz.itch.io/peaky-invaders-2d-game",
    "bgcolor": "var(--hl-color)",
    "id": "4"
  },
  {
    "title": "TASKHUB",
    "description": "Full stack Web Application for students to delegate their tasks to each other",
    "video": "",
    "image": "",
    "image2": "../../images/lms.png",
    "image3": "",
    "technologies": ["Java", "Desktop", "GUI"],
    "body": "Taskhub was a collaborative project developed during my third-semester database systems course. It focused on creating a platform for task management, enabling users to create, assign, and track tasks within a team. The application was developed in Java, providing a desktop-oriented solution with a user-friendly GUI.",
    "github": "https://github.com/muhammadawa242/taskhub_dbs_project",
    "deployed": "",
    "bgcolor": "var(--hl-color)",
    "id": "5"
  },
  {
    "title": "Deleted Images Recovery Program",
    "description": "A CLI program to recover images from .raw file",
    "video": "",
    "image": "",
    "image2": "",
    "image3": "",
    "body": "A program in C language to recover deleted JPG files from memory. It is designed for digital cameras that use the FAT file system with a block size of 512 bytes. The project showcased my skills in low-level programming and file system handling in a resource-constrained environment.",
    "technologies": ["C", "File Recovery", "Low-Level Programming"],
    "github": "https://github.com/muhammadawa242/image_recovery",
    "deployed": "",
    "bgcolor": "var(--hl2-color)",
    "id": "6"
  },

  {
    "title": "Binance Web App",
    "description": "Full Stack Web Application using IEX API for stock prices",
    "video": "",
    "image": "",
    "image2": "",
    "image3": "",
    "technologies": ["Flask", "Python", "HTML", "CSS", "JavaScript", "SQL", "Web Development"],
    "body": "A dynamic web application called CS50's Finance using Flask, Python's web framework. The application incorporates HTML, CSS, JavaScript, Jinja, and SQL to provide a robust experience for tracking stock prices, managing a portfolio, and simulating stock trading. The project demonstrated my full-stack development capabilities.",
    "github": "https://github.com/muhammadawa242/last_week",
    "deployed": "",
    "bgcolor": "var(--hl2-color)",
    "id": "7"
  }
]
